Catalogs/ЛБ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КомплектующиеИзделия</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСписок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСтрокаВнутренняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Для описания сути настройки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КомплектующиеИзделия</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение0</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПароль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСтрокаВнутренняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_Настройки/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеСправочника(Наименование, ТипВозврата = "Структура") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛБ_Настройки.Наименование,
	|	ЛБ_Настройки.Значение,
	|	ЛБ_Настройки.Значение0,
	|	ЛБ_Настройки.ЭтоСтрокаВнутренняя,
	|	ЛБ_Настройки.ЭтоСписок
	|ИЗ
	|	Справочник.ЛБ_Настройки КАК ЛБ_Настройки
	|ГДЕ
	|	ЛБ_Настройки.Наименование = &Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛБ_НастройкиСписок.Наименование,
	|	ЛБ_НастройкиСписок.Значение,
	|	ЛБ_НастройкиСписок.Значение0,
	|	ЛБ_НастройкиСписок.ЭтоСтрокаВнутренняя,
	|	ЛБ_НастройкиСписок.Ссылка.ЭтоСписок
	|ИЗ
	|	Справочник.ЛБ_Настройки.Список КАК ЛБ_НастройкиСписок
	|ГДЕ
	|	ЛБ_НастройкиСписок.Ссылка.Наименование = &Наименование
	|	И ЛБ_НастройкиСписок.Ссылка.ЭтоСписок";
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗ0 = Пакет[0].Выгрузить();
	Если ТЗ0.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	Если ТЗ0[0].ЭтоСписок Тогда
		ТЗ1 = Пакет[1].Выгрузить();
		Если ТипВозврата = "ТаблицаЗначений" Тогда
			Результат = ТЗ1;
		ИначеЕсли ТипВозврата = "Структура" Тогда
			Результат = Новый Структура;
			Для Каждого Строка Из ТЗ1 Цикл
				Результат.Вставить(Строка.Наименование, ?(Строка.ЭтоСтрокаВнутренняя, Строка.Значение0, Строка.Значение));
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ТипВозврата = "ТаблицаЗначений" Тогда
			Результат = ТЗ0;
		ИначеЕсли ТипВозврата = "Структура" Тогда
			Результат = Новый Структура(Наименование, ?(ТЗ0[0].ЭтоСтрокаВнутренняя, ТЗ0[0].Значение0, ТЗ0[0].Значение));
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция СохранитьЗначениеСправочника(Данные) Экспорт
	
	// Данные = Структура("Наименование,ЭтоСписок,Данные")
	// Для Не списка	Данные = Структура("ЭтоПароль,ЭтоСтрокаВнутренняя,Значение")
	// Для списка		Данные = Массив(Структура("Наименование,ЭтоПароль,ЭтоСтрокаВнутренняя,Значение"))
	
	Результат = "";
	
	Элем = Справочники.ЛБ_Настройки.НайтиПоНаименованию(Данные.Наименование);
	Если Не ЗначениеЗаполнено(Элем) Тогда
		ЭлемОбъект = Справочники.ЛБ_Настройки.СоздатьЭлемент();
	Иначе
		ЭлемОбъект = Элем.ПолучитьОбъект();
		ЭлемОбъект.Список.Очистить();
		ЭлемОбъект.Значение = Неопределено;
		ЭлемОбъект.Значение0 = "";
	КонецЕсли;
	
	ЭлемОбъект.Наименование	= Данные.Наименование;
	ЭлемОбъект.ЭтоСписок	= Данные.ЭтоСписок;
	Если Не Данные.ЭтоСписок Тогда
		ЭлемОбъект.ЭтоПароль			= Данные.Данные.ЭтоПароль;
		ЭлемОбъект.ЭтоСтрокаВнутренняя	= Данные.Данные.ЭтоСтрокаВнутренняя;
		Если Данные.Данные.ЭтоСтрокаВнутренняя Тогда
			ЭлемОбъект.Значение0 = Данные.Данные.Значение;
		Иначе
			ЭлемОбъект.Значение	 = Данные.Данные.Значение;
		КонецЕсли;
	Иначе
		Для Каждого Строка Из Данные.Данные Цикл
			НоваяСтрока = ЭлемОбъект.Список.Добавить();
			НоваяСтрока.Наименование		= Строка.Наименование;
			НоваяСтрока.ЭтоПароль			= Строка.ЭтоПароль;
			НоваяСтрока.ЭтоСтрокаВнутренняя = Строка.ЭтоСтрокаВнутренняя;
			Если Строка.ЭтоСтрокаВнутренняя Тогда
				НоваяСтрока.Значение0 = Строка.Значение;
			Иначе
				НоваяСтрока.Значение  = Строка.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		ЭлемОбъект.Записать();
	Исключение
		Результат = "Не удалось записать настройки. " + ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьЗначениеПростойНастройки(ИмяНастройки, Значение) Экспорт
	
	Элем = Справочники.ЛБ_Настройки.НайтиПоНаименованию(ИмяНастройки);
	
	Если ЗначениеЗаполнено(Элем) Тогда
		ЭлемОбъект = Элем.ПолучитьОбъект();
		Если ЭлемОбъект.ЭтоСписок Тогда
			ВызватьИсключение "Полученный элемент настроек является списком!";
		КонецЕсли;
	Иначе
		ЭлемОбъект = Справочники.ЛБ_Настройки.СоздатьЭлемент();
		ЭлемОбъект.Наименование = ИмяНастройки;
	КонецЕсли;
	
	ЭлемОбъект.Значение = Значение;
	ЭлемОбъект.Записать();
	
КонецФункции

Функция ПрочитатьЗначениеПростойНастройки(ИмяНастройки, ЗначениеПустого = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", ИмяНастройки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛБ_Настройки.Значение КАК Значение,
	|	ЛБ_Настройки.ЭтоСписок КАК ЭтоСписок
	|ИЗ
	|	Справочник.ЛБ_Настройки КАК ЛБ_Настройки
	|ГДЕ
	|	ЛБ_Настройки.Наименование = &Наименование";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Если ЗначениеЗаполнено(ЗначениеПустого) Тогда
			УстановитьЗначениеПростойНастройки(ИмяНастройки, ЗначениеПустого);
			Возврат ЗначениеПустого;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ЭтоСписок Тогда
		ВызватьИсключение "Полученный элемент настроек является списком!";
	КонецЕсли;
	
	Возврат Выборка.Значение;
	
КонецФункции
